// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

System.Console.WriteLine("Введите число: ");
int [] number = int.Parse(Console.ReadLine()!);
index[0];
if (number >99 && number < 1000)
{
    Console.WriteLine ("третьей цифры нет");
}
if (number > 99)
{
      Console.WriteLine (index [2]);
}



